slides/framework_development.tex
% Created 2014-11-20 木 20:44
\documentclass[t, aspectratio=169]{beamer}
\usepackage{zxjatype}
\usepackage[ipa]{zxjafont}
\setbeamertemplate{navigation symbols}{}
\hypersetup{colorlinks,linkcolor=,urlcolor=gray}
\AtBeginPart
{
  \begin{frame}<beamer|handout>
    \date{\insertpart}
    \maketitle
  \end{frame}
}
\AtBeginSection[]
{
  \begin{frame}<beamer>
  \tableofcontents[currentsection,currentsubsection]
  \end{frame}
}

\usepackage{minted}
\institute[AIIT]{産業技術大学院大学(AIIT)}
\usetheme{Berkeley}
\usecolortheme{seahorse}
\useinnertheme{rectangles}
\author{中鉢 欣秀}
\date{}
\title{フレームワーク開発特論}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.3.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle

\part{第1章 この授業について}
\label{sec-1}
\section{導入}
\label{sec-1-1}
\begin{frame}[label=sec-1-1-1]{はじめに}
\begin{block}{自己紹介}
\begin{itemize}
\item \href{https://github.com/ychubachi/enpit/blob/master/slides/self_introduction.org}{enpit/self\_introduction.org at master · ychubachi/enpit}
\end{itemize}
\end{block}
\begin{block}{シラバス}
\begin{itemize}
\item \href{http://aiit.ac.jp/master_program/isa/lecture/pdf/h26/4_6.pdf}{フレームワーク開発特論}
\end{itemize}
\end{block}
\begin{block}{ハンドアウト}
\begin{itemize}
\item \href{https://github.com/ychubachi/framework_development/blob/master/slides/framework_development.org}{framework\_development/framework\_development.org at master · ychubachi/framework\_development}
\end{itemize}
\end{block}
\end{frame}
\begin{frame}[label=sec-1-1-2]{授業の計画}
\begin{block}{スケジュールの調整}
\begin{itemize}
\item 基本的にはシラバス通りに行うが，
本年度から内容を刷新して新規に行う授業のため
計画の変更がありえる
\end{itemize}
\end{block}
\begin{block}{休講・補講}
\begin{itemize}
\item 10/9（木） ビデオ視聴（休講）
\end{itemize}
\end{block}
\end{frame}

\section{学習目的・目標}
\label{sec-1-2}
\begin{frame}[label=sec-1-2-1]{この授業の目的}
\begin{itemize}
\item 再利用可能なコンポーネント開発の概念的理解を行う
\item RubyのGemを題材に，実装技術を学ぶ
\end{itemize}
\end{frame}
\begin{frame}[label=sec-1-2-2]{この授業の目標}
\begin{itemize}
\item Rubyで実際にコーデングを行い，コンポーネントを開発できる
\item Git/GitHubを用い，開発の効率の向上・成果物の公開などができる
\item Rubyのテスト技術について学ぶ
\item RubyGemsに公開する方法
\end{itemize}
\end{frame}

\section{授業の方法}
\label{sec-1-3}
\begin{frame}[label=sec-1-3-1]{この授業で用いる資料}
\begin{itemize}
\item この授業で取り上げる資料は，開発コミュニティが公開している
Webページを中心に適宜紹介する
\item エンジニアは英語の原典を読めなくてはならないので，英語のページ
を見ながら解説する
\item スライド・ハンドアウトは適宜更新するので，
必要に応じてダウンロードすること
\end{itemize}
\end{frame}

\begin{frame}[label=sec-1-3-2]{Git/GitHubの活用}
\begin{itemize}
\item GitHubのアカウントを作成しておくこと
\item ソースコードを作成する課題は，GitHubにも登録してもらうことがある
\end{itemize}
\end{frame}

\begin{frame}[label=sec-1-3-3]{仮想化環境の準備}
\begin{itemize}
\item Rubyの開発環境
\begin{itemize}
\item enPiTの仮想環境を利用
\end{itemize}
\item インストールの方法
\begin{itemize}
\item 資料
\begin{itemize}
\item \href{https://github.com/ychubachi/enpit/blob/master/slides/preparation.org}{enpit/preparation.org at master · ychubachi/enpit}
\end{itemize}
\item 動画を参照
\begin{itemize}
\item \url{http://youtu.be/kePqg8dCgJM}
\end{itemize}
\item 注意
\begin{itemize}
\item 動画の視聴及び作業のために2時間程度かかる
\end{itemize}
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[fragile,label=sec-1-3-4]{仮想化環境の設定}
 \begin{block}{内容}
\begin{itemize}
\item enPiT用に作成したVagrantのboxファイルの入手して
実行できるようにする
\item Vagrantのバージョンは最新版にしておく
\item Vagrantのインストール後，次のコマンドでインストール可能
\end{itemize}
\end{block}

\begin{block}{コマンド}
\begin{minted}[]{bash}
vagrant init ychubachi/enpit
\end{minted}
\end{block}
\end{frame}

\section{RubyのGemとは}
\label{sec-1-4}
\begin{frame}[label=sec-1-4-1]{Rubyによるコンポーネント}
\begin{itemize}
\item Rubyには，再利用可能なコンポーネントを
取り扱う仕組みとしてGemがある
\item 資料
\begin{itemize}
\item \href{http://guides.rubygems.org/}{RubyGems Guides}
\end{itemize}
\end{itemize}
\end{frame}
\begin{frame}[fragile,label=sec-1-4-2]{基本的なコマンド}
 \begin{itemize}
\item \texttt{gem} コマンドは，Rubyでコンポーネントを開発したり，
配布をしたりする等の際に利用するコマンド
\item 後に解説する \texttt{bundler} コマンドの基盤
\item 資料
\begin{itemize}
\item \href{http://guides.rubygems.org/rubygems-basics/}{RubyGems Basics - RubyGems Guides}
\end{itemize}
\end{itemize}
\end{frame}
\section{演習課題}
\label{sec-1-5}
\begin{frame}[label=sec-1-5-1]{課題1-1}
\begin{block}{開発環境の構築}
\begin{itemize}
\item 演習用仮想化環境を用意する
\item 資料と動画を参照
\end{itemize}
\end{block}
\begin{block}{作業内容}
\begin{itemize}
\item VirtualBox と Vagrantをインストールする
\begin{itemize}
\item \href{https://www.virtualbox.org/}{Oracle VM VirtualBox}
\item \href{https://www.vagrantup.com/}{Vagrant}
\end{itemize}
\end{itemize}
\end{block}
\end{frame}
\begin{frame}[fragile,label=sec-1-5-2]{課題1-2}
 \begin{block}{開発環境の構築}
\begin{itemize}
\item enPiT仮想化環境をインストールする
\end{itemize}
\end{block}
\begin{block}{コマンド}
\begin{minted}[]{bash}
vagrant init ychubachi/enpit
vagrant up
vagrant ssh
\end{minted}
\end{block}
\end{frame}

\begin{frame}[fragile,label=sec-1-5-3]{課題1-3}
 \begin{block}{RubyGems Basics}
\begin{itemize}
\item 下記のガイドに記されたサンプルを実行し，
\texttt{gem} コマンドの基本的な使い方を学ぶ
\end{itemize}
\end{block}
\begin{block}{ガイド}
\begin{itemize}
\item \href{http://guides.rubygems.org/rubygems-basics/}{RubyGems Basics - RubyGems Guides}
\end{itemize}
\end{block}
\end{frame}
\begin{frame}[fragile,label=sec-1-5-4]{課題1-4}
 \begin{block}{演習}
\begin{itemize}
\item gemをダウンロードして中身を見てみる
\item \texttt{search}, \texttt{fetch},  \texttt{unpack} などのコマンドを活用する
\end{itemize}
\end{block}
\end{frame}
\part{第2章 RubyGemsの概要と周辺のツール群}
\label{sec-2}
\section{RubyGemsの解説(1)}
\label{sec-2-1}
\begin{frame}[label=sec-2-1-1]{Ruby Gemsのガイド}
\begin{itemize}
\item \href{http://guides.rubygems.org/what-is-a-gem/}{What is a gem? - RubyGems Guides}
\item \href{http://guides.rubygems.org/make-your-own-gem/}{Make your own gem - RubyGems Guides}
\item \href{http://guides.rubygems.org/gems-with-extensions/}{Gems with Extensions - RubyGems Guides}
\begin{itemize}
\item C言語拡張（省略）
\end{itemize}
\end{itemize}
\end{frame}
\section{RubyGemsの解説(2)}
\label{sec-2-2}
\begin{frame}[label=sec-2-2-1]{Ruby Gemsのガイド}
\begin{itemize}
\item \href{http://guides.rubygems.org/name-your-gem/}{Name your gem - RubyGems Guides}
\item \href{http://guides.rubygems.org/publishing/}{Publishing your gem - RubyGems Guides}
\item \href{http://guides.rubygems.org/security/}{Security - RubyGems Guides}
\begin{itemize}
\item セキュリティ（省略）
\end{itemize}
\item \href{http://guides.rubygems.org/patterns/}{Patterns - RubyGems Guides}
\end{itemize}
\end{frame}
\section{補足}
\label{sec-2-3}
\begin{frame}[label=sec-2-3-1]{MiniTest}
\begin{itemize}
\item \href{http://docs.ruby-lang.org/ja/2.0.0/library/minitest=2funit.html}{library minitest/unit}
\end{itemize}
\end{frame}
\section{演習課題}
\label{sec-2-4}
\begin{frame}[label=sec-2-4-1]{課題2-1 RubyGems.orgにアカウントを作成}
\begin{itemize}
\item RubyGems.orgにアカウントを作成しなさい
\item \href{https://rubygems.org/}{RubyGems.org | your community gem host}
\begin{itemize}
\item 「sign up」リンクから作成する
\end{itemize}
\end{itemize}
\end{frame}
\begin{frame}[label=sec-2-4-2]{課題2-2 ガイドを参考にGemを作る}
\begin{itemize}
\item ガイドの解説に従い，"hola" Gemを作成しなさい
\begin{itemize}
\item \href{http://guides.rubygems.org/make-your-own-gem/}{Make your own gem - RubyGems Guides}
\end{itemize}
\item 演習用Gemの名前の付け方
\begin{itemize}
\item hola\_(username)
\item 括弧内はRubyGemsのユーザ名に置き換えよ
\end{itemize}
\end{itemize}
\end{frame}
\part{第3章 Ruby自体のバージョン管理}
\label{sec-3}
\section{Rbenvの解説}
\label{sec-3-1}
\begin{frame}[label=sec-3-1-1]{Rubyのバージョン}
\begin{itemize}
\item Rubyには様々なバージョンがある
\begin{itemize}
\item 最新の安定版: Ruby 2.1.3
\item 前世代の安定版: Ruby 2.0.0-p576
\item 古い安定版: Ruby 1.9.3-p547
\item 1.8.7，1.9.2はサポート終了
\end{itemize}
\item これら以外にも，Javaや.NET Framework上で動作するものなど多数．
\end{itemize}
\end{frame}
\begin{frame}[label=sec-3-1-2]{開発時の混乱}
\begin{itemize}
\item 開発プロジェクトによって，異なるバージョンのRubyが用いられる
\item 複数の開発プロジェクトに参加する開発者が，
毎回手動でバージョンを変更するのは困難であるし，
トラブルの原因となる
\end{itemize}
\end{frame}
\begin{frame}[label=sec-3-1-3]{Rbenvについて}
\begin{block}{概要}
\begin{itemize}
\item バージョンの異なる複数のRubyを管理するツールであり，
主要なエコシステムの一部
\item プラグインを追加することで，インストールも自動化できる
\end{itemize}
\end{block}
\begin{block}{GitHub}
\begin{itemize}
\item \href{https://github.com/sstephenson/rbenv}{sstephenson/rbenv}
\end{itemize}
\end{block}
\begin{block}{RVMとの比較}
\begin{itemize}
\item \href{https://github.com/sstephenson/rbenv/wiki/Why-rbenv\%3F}{Why rbenv? · sstephenson/rbenv Wiki}
\end{itemize}
\end{block}
\end{frame}
\section{演習課題}
\label{sec-3-2}
\begin{frame}[fragile,label=sec-3-2-1]{課題3-1 別なRubyバージョンのインストール}
 \begin{itemize}
\item \texttt{rbenv} を用いて，異なるバージョンのRubyをインストールする
\end{itemize}
\end{frame}
\begin{frame}[fragile,label=sec-3-2-2]{課題3-2 Rubyのバージョンを切り替える}
 \begin{itemize}
\item \texttt{rbenv} を用い，=ruby= のバージョンを切り替える
\end{itemize}
\end{frame}
\part{第4章 プロジェクトで利用するGemの管理}
\label{sec-4}
\section{プロジェクトとGem}
\label{sec-4-1}
\begin{frame}[label=sec-4-1-1]{プロジェクトごとに異なるGemの集合}
\begin{itemize}
\item 開発プロジェクトにおいて利用するGemは異なるばかりではなく，
Gemのバージョンについても注意が必要である
\item Gemコマンドを直接用いてインストールする方法では，
必要なGemを主導で管理しなくてはならないし，
バージョンの異なるGemを用いる場合もある
\end{itemize}
\end{frame}
\section{BundlerでGemを利用する}
\label{sec-4-2}
\begin{frame}[label=sec-4-2-1]{Bundlerについて}
\begin{itemize}
\item \href{http://bundler.io/}{Bundler: The best way to manage a Ruby application's gems}
\end{itemize}
\end{frame}
\begin{frame}[label=sec-4-2-2]{ドキュメントの解説}
\begin{itemize}
\item \href{http://bundler.io/rationale.html}{Why Bundler exists}
\item \href{https://github.com/sstephenson/rbenv/wiki/Understanding-binstubs}{Understanding binstubs · sstephenson/rbenv Wiki}
\item \href{http://bundler.io/gemfile.html}{Gemfile}
\end{itemize}
\end{frame}
\begin{frame}[fragile,label=sec-4-2-3]{bundleコマンドのインストール}
 \begin{block}{bundleコマンド}
\begin{itemize}
\item \texttt{gem} と違い， \texttt{bundle} コマンドは標準ではインストールされていない．
\end{itemize}
\end{block}
\begin{block}{Gemによるインストール方法}
\begin{minted}[]{bash}
gem install bundler
\end{minted}
\end{block}
\end{frame}

\section{BundlerによるGemの作成}
\label{sec-4-3}
