slides/framework_development.org
**** コマンド
#+begin_src bash
bundle gem my_gem_name
#+end_src

*** 雛形の内容

#+begin_src text
  .
  ├── .git
    <snip>
  ├── .gitignore
  ├── Gemfile
  ├── LICENSE.txt
  ├── README.md
  ├── Rakefile
  ├── lib
  │   ├── my_gem_name
  │   │   └── version.rb
  │   └── my_gem_name.rb
  └── my_gem_name.gemspec
#+end_src

*** =git ls-files= について
    - gitにindexされているファイルの一覧
    - 新しいファイルは，ステージング領域にaddされると表示に加わる
    - =.gitignore= で無視するファイルを設定できる

*** 雛形のbuild
    - =*.gemspec= のTODOを外す（内容をきちんと書く）
    - =rake build= でbuildできる

*** =executable= の作成と注意
    - =bundle gem -b= で実行可能なスクリプトの雛形ができる
    - 実行属性を =chmod a+x= でつける
    - =bundle install --binstubs= を実行すると，上書きされるので注意
      - 手動で他のディレクトリ（ =/exe= ）に作成するほうが良い

*** Gemfileとgemspecの関係
    - Gemの依存関係のかき分け
      - Gemfile
	- =Gemfile= に =gemspec= メソッドがあれば， =.gemspec= 内のGem依存関係を解決する
      - *.gemspec
	- Gemを利用時に必要なGemを追加

*** COMMENT binstubs
    - rails 4以降，binstubsはgitに加えるように推奨されている
      - [[http://factore.ca/blog/250-safe-binstubs-with-rails][factor[e]]]

** 演習課題
*** 4-1 Bundlerで簡単なGemを作ってみる
**** 課題
     - 簡単な計算を行うコマンドをGemとして作成しなさい．
     - 外部のGemを利用する場合は，
       gemspecファイルに依存関係を記述すること
**** 例
     - 生年月日と今の年月日から年齢を計算する
     - 身長と体重を入力して，BMIを出す
     - その他，各自で考えよ
*** 4-2 作成したGemをGitHubで公開する
**** 課題
    - 作成したGemのソースコードをGitHubに公開しなさい
      - =hub create= でGitHubのリポジトリを作成
      - =git add= ， =git commit= でコミット
      - =git push -u origin master= でGitHubに登録
**** 提出
    - GitHubのURLをLMSに提出する
*** 4-3 GemをRubyOrgに登録する
**** 課題
    - 作成したGemをRubyOrgに登録する
    - Gemの名前には，aiitのアカウント名を先頭につけること
      - a14???xx_name
**** 提出
     - RubyOrgのURL
* 第5章 Rakeによるタスクの実行
** Rakeの文書
*** ドキュメント
    - [[https://github.com/jimweirich/rake][jimweirich/rake]]
    - [[http://devblog.avdi.org/2014/04/21/rake-part-1-basics/][Rake Part 1: Files and Rules | Virtuous Code]]
    - [[http://nilquebe.blogspot.jp/2014/06/learn-advanced-rake-in-7-episodes.html][Nilquebe Blog: Rake Part 1: Files and Rules 翻訳]]

** 簡単なRakefileの例
*** タスクの定義
**** Rakefile
#+begin_src ruby
task :hello do
  puts 'do task hello!'
end
#+end_src

*** 説明を追加した例
**** Rakefile
#+begin_src ruby
desc 'say hello'
task :hello do
  puts 'do task hello!'
end
#+end_src

*** タスクの一覧
**** コマンド
#+begin_src bash
rake -T
#+end_src

*** Bundlerが自動生成するgem
**** Rakefile
#+begin_src ruby
require "bundler/gem_tasks"
#+end_src

**** タスクの定義
     - 実際のタスクは =bundler/gem_tasks= 内にある
     - なお， コードの在処は =gem which bundler= で確認できる

* 第6章 Rubyによる単体テスト
** Rubyによるテスト技法
*** 各種のテスト技法(1)
   - Minitest
     - Rubyに標準のテストツール
     - [[http://www.ruby-doc.org/stdlib-2.0/libdoc/minitest/rdoc/MiniTest.html][Module: MiniTest (Ruby 2.0.0)]]
   - RSpec
     - 広く普及しているテストツール
     - 「振る舞い駆動」
     - [[http://rspec.info/][RSpec.info: home]]
*** 各種のテスト技法(2)
   - Cucumber
     - [[http://cukes.info/][Cucumber - Making BDD fun]]
   - Turnip
     - [[https://github.com/jnicklas/turnip][jnicklas/turnip]]

** テストを含むGemの生成
*** bundle gemのオプション
**** minitestを使う場合
#+begin_src bash
bundle gem gem_mini_test --test=minitest
#+end_src

*** minitest用のRakefile
**** Rakefile
#+begin_src ruby
require "bundler/gem_tasks"
require "rake/testtask"

Rake::TestTask.new(:test) do |t|
  t.libs << "test"
end

task :default => :test
#+end_src

*** test/の中身
**** ファイル
#+begin_src text
test
|-- minitest_helper.rb
`-- test_gem_minitest.rb
#+end_src
**** 内容
     - =minitest_helper.rb= :: テストを実行する際に必ず読み込まれる
     - =test_gem_minitest.rb= :: テストを書く場所


** minitestの書き方
*** minitestのドキュメント
**** ドキュメント
    - 英語版
      - [[http://ruby-doc.org/stdlib-2.1.0/libdoc/minitest/rdoc/MiniTest.html][Module: MiniTest (Ruby 2.1.0)]]
    - 日本語版
      - [[http://docs.ruby-lang.org/ja/2.1.0/library/minitest=2funit.html][library minitest/unit]]
*** Assertion
    - Assertionとは？
      - [[http://docs.ruby-lang.org/ja/2.1.0/class/MiniTest=3a=3aAssertions.html][module MiniTest::Assertions]]
*** Gem版minitest
**** コード
    - GitHub参照
      - [[https://github.com/ychubachi/gem_minitest][ychubachi/gem_minitest]]

** 演習課題
*** 6-1 Gemの作成
**** 課題
     - テストの演習をするためのGemを作成しなさい
**** コマンド

#+begin_src bash
  bundle gem mini_test_practice --test=minitest
#+end_src

*** 6-2 メソッドの作成(1)
**** 課題
     - 次の仕様に沿ったテストを作成しなさい
     - テストができたら，コードを書きなさい
**** 仕様
     - メソッド名 :: =odd?=
     - 内容 :: 整数を入力として受け取り，値が奇数ならば真を返す

*** 6-3 メソッドの作成(2)
**** 課題
     - 次の仕様に沿ったテストを作成しなさい
     - テストができたら，コードを書きなさい
**** 仕様
     - メソッド名 :: =check_number?=
     - 内容 :: 引数が0以外ではじまる4桁の数字であり，なおかつ，値が偶数ならば
       真を返す

*** 6-4 メソッドの作成(3)
**** 課題
     - 次の仕様に沿ったテストを作成しなさい
     - テストができたら，コードを書きなさい
**** 仕様
     - メソッド名 :: =enough_length?=
     - 内容 :: 文字列を受け取り，その長さが3文字以上，8文字以下であれば
       真を返す

*** 6-5 メソッドの作成(4)
**** 課題
     - 次の仕様に沿ったテストを作成しなさい
     - テストができたら，コードを書きなさい
**** 仕様
     - メソッド名 :: =divide=
     - 内容 :: 引数として割る数と割られる数を取り，割り算をした結果を返す．
       ただし，0で割り算をしたら例外を発生する

*** 6-6 メソッドの作成(5)
**** 課題
     - 次の仕様に沿ったテストを作成しなさい
     - テストができたら，コードを書きなさい
**** 仕様
     - メソッド名 :: =fizz_buzz=
     - 内容 :: 引数に数値を1つとる．3の倍数の時は”Fizz”を返す．
       5の倍数の時は”Buzz”を返す．3と5の公倍数のときは”FizzBuzz”を返す．

*** 6-7 メソッドの作成(6)
**** 課題
     - 次の仕様に沿ったテストを作成しなさい
     - テストができたら，コードを書きなさい
**** 仕様
     - 標準出力に「Hello」と表示するプログラムのテストと実装を行いなさい

*** 参考
**** サンプル
     - https://github.com/ychubachi/mini_test_practice

* 第7章 テスト自動化と統合テスト
** Guardによる方法
*** Guardとは？
   - =Guard= とは，ファイルの更新を監視して，更新があれば指定されたタスクを
     実行する仕組み
   - 詳細
     - [[https://github.com/guard/guard][guard/guard]]
*** MiniTestの自動化
    - Guardにはプラグイン機能がある
    - MiniTest用のプラグイン
      - [[https://github.com/guard/guard-minitest][guard/guard-minitest]]
    - Gemfileに追加し，bundle installが必要
*** サンプル
    - Guard用の設定を行ったコード
      - [[https://github.com/ychubachi/mini_test_practice][ychubachi/mini_test_practice]]
** Travis CIによる方法
