slides/framework_development.tex
\begin{frame}[fragile,label=sec-4-3-1]{ひな形の自動生成}
 \begin{block}{ひな形の自動生成}
\begin{itemize}
\item \href{http://bundler.io/v1.7/bundle_gem.html}{Bundler: The best way to manage a Ruby application's gems}
\end{itemize}
\end{block}
\begin{block}{コマンド}
\begin{minted}[]{bash}
bundle gem my_gem_name
\end{minted}
\end{block}
\end{frame}

\begin{frame}[fragile,label=sec-4-3-2]{雛形の内容}
 \begin{minted}[]{text}
.
├── .git
  <snip>
├── .gitignore
├── Gemfile
├── LICENSE.txt
├── README.md
├── Rakefile
├── lib
│   ├── my_gem_name
│   │   └── version.rb
│   └── my_gem_name.rb
└── my_gem_name.gemspec
\end{minted}
\end{frame}

\begin{frame}[fragile,label=sec-4-3-3]{\texttt{git ls-files} について}
 \begin{itemize}
\item gitにindexされているファイルの一覧
\item 新しいファイルは，ステージング領域にaddされると表示に加わる
\item \texttt{.gitignore} で無視するファイルを設定できる
\end{itemize}
\end{frame}

\begin{frame}[fragile,label=sec-4-3-4]{雛形のbuild}
 \begin{itemize}
\item \texttt{*.gemspec} のTODOを外す（内容をきちんと書く）
\item \texttt{rake build} でbuildできる
\end{itemize}
\end{frame}

\begin{frame}[fragile,label=sec-4-3-5]{\texttt{executable} の作成と注意}
 \begin{itemize}
\item \texttt{bundle gem -b} で実行可能なスクリプトの雛形ができる
\item 実行属性を \texttt{chmod a+x} でつける
\item \texttt{bundle install -{}-binstubs} を実行すると，上書きされるので注意
\begin{itemize}
\item 手動で他のディレクトリ（ \texttt{/exe} ）に作成するほうが良い
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[fragile,label=sec-4-3-6]{Gemfileとgemspecの関係}
 \begin{itemize}
\item Gemの依存関係のかき分け
\begin{itemize}
\item Gemfile
\begin{itemize}
\item \texttt{Gemfile} に \texttt{gemspec} メソッドがあれば， \texttt{.gemspec} 内のGem依存関係を解決する
\end{itemize}
\item *.gemspec
\begin{itemize}
\item Gemを利用時に必要なGemを追加
\end{itemize}
\end{itemize}
\end{itemize}
\end{frame}

\section{演習課題}
\label{sec-4-4}
\begin{frame}[label=sec-4-4-1]{4-1 Bundlerで簡単なGemを作ってみる}
\begin{block}{課題}
\begin{itemize}
\item 簡単な計算を行うコマンドをGemとして作成しなさい．
\item 外部のGemを利用する場合は，
gemspecファイルに依存関係を記述すること
\end{itemize}
\end{block}
\begin{block}{例}
\begin{itemize}
\item 生年月日と今の年月日から年齢を計算する
\item 身長と体重を入力して，BMIを出す
\item その他，各自で考えよ
\end{itemize}
\end{block}
\end{frame}
\begin{frame}[fragile,label=sec-4-4-2]{4-2 作成したGemをGitHubで公開する}
 \begin{block}{課題}
\begin{itemize}
\item 作成したGemのソースコードをGitHubに公開しなさい
\begin{itemize}
\item \texttt{hub create} でGitHubのリポジトリを作成
\item \texttt{git add} ， \texttt{git commit} でコミット
\item \texttt{git push -u origin master} でGitHubに登録
\end{itemize}
\end{itemize}
\end{block}
\begin{block}{提出}
\begin{itemize}
\item GitHubのURLをLMSに提出する
\end{itemize}
\end{block}
\end{frame}
\begin{frame}[label=sec-4-4-3]{4-3 GemをRubyOrgに登録する}
\begin{block}{課題}
\begin{itemize}
\item 作成したGemをRubyOrgに登録する
\item Gemの名前には，aiitのアカウント名を先頭につけること
\begin{itemize}
\item a14???xx\_name
\end{itemize}
\end{itemize}
\end{block}
\begin{block}{提出}
\begin{itemize}
\item RubyOrgのURL
\end{itemize}
\end{block}
\end{frame}
\part{第5章 Rakeによるタスクの実行}
\label{sec-5}
\section{Rakeの文書}
\label{sec-5-1}
\begin{frame}[label=sec-5-1-1]{ドキュメント}
\begin{itemize}
\item \href{https://github.com/jimweirich/rake}{jimweirich/rake}
\item \href{http://devblog.avdi.org/2014/04/21/rake-part-1-basics/}{Rake Part 1: Files and Rules | Virtuous Code}
\item \href{http://nilquebe.blogspot.jp/2014/06/learn-advanced-rake-in-7-episodes.html}{Nilquebe Blog: Rake Part 1: Files and Rules 翻訳}
\end{itemize}
\end{frame}

\section{簡単なRakefileの例}
\label{sec-5-2}
\begin{frame}[fragile,label=sec-5-2-1]{タスクの定義}
 \begin{block}{Rakefile}
\begin{minted}[]{ruby}
task :hello do
  puts 'do task hello!'
end
\end{minted}
\end{block}
\end{frame}

\begin{frame}[fragile,label=sec-5-2-2]{説明を追加した例}
 \begin{block}{Rakefile}
\begin{minted}[]{ruby}
desc 'say hello'
task :hello do
  puts 'do task hello!'
end
\end{minted}
\end{block}
\end{frame}

\begin{frame}[fragile,label=sec-5-2-3]{タスクの一覧}
 \begin{block}{コマンド}
\begin{minted}[]{bash}
rake -T
\end{minted}
\end{block}
\end{frame}

\begin{frame}[fragile,label=sec-5-2-4]{Bundlerが自動生成するgem}
 \begin{block}{Rakefile}
\begin{minted}[]{ruby}
require "bundler/gem_tasks"
\end{minted}
\end{block}

\begin{block}{タスクの定義}
\begin{itemize}
\item 実際のタスクは \texttt{bundler/gem\_tasks} 内にある
\item なお， コードの在処は \texttt{gem which bundler} で確認できる
\end{itemize}
\end{block}
\end{frame}

\part{第6章 Rubyによる単体テスト}
\label{sec-6}
\section{Rubyによるテスト技法}
\label{sec-6-1}
\begin{frame}[label=sec-6-1-1]{各種のテスト技法(1)}
\begin{itemize}
\item Minitest
\begin{itemize}
\item Rubyに標準のテストツール
\item \href{http://www.ruby-doc.org/stdlib-2.0/libdoc/minitest/rdoc/MiniTest.html}{Module: MiniTest (Ruby 2.0.0)}
\end{itemize}
\item RSpec
\begin{itemize}
\item 広く普及しているテストツール
\item 「振る舞い駆動」
\item \href{http://rspec.info/}{RSpec.info: home}
\end{itemize}
\end{itemize}
\end{frame}
\begin{frame}[label=sec-6-1-2]{各種のテスト技法(2)}
\begin{itemize}
\item Cucumber
\begin{itemize}
\item \href{http://cukes.info/}{Cucumber - Making BDD fun}
\end{itemize}
\item Turnip
\begin{itemize}
\item \href{https://github.com/jnicklas/turnip}{jnicklas/turnip}
\end{itemize}
\end{itemize}
\end{frame}

\section{テストを含むGemの生成}
\label{sec-6-2}
\begin{frame}[fragile,label=sec-6-2-1]{bundle gemのオプション}
 \begin{block}{minitestを使う場合}
\begin{minted}[]{bash}
bundle gem gem_mini_test --test=minitest
\end{minted}
\end{block}
\end{frame}

\begin{frame}[fragile,label=sec-6-2-2]{minitest用のRakefile}
 \begin{block}{Rakefile}
\begin{minted}[]{ruby}
require "bundler/gem_tasks"
require "rake/testtask"

Rake::TestTask.new(:test) do |t|
  t.libs << "test"
end

task :default => :test
\end{minted}
\end{block}
\end{frame}

\begin{frame}[fragile,label=sec-6-2-3]{test/の中身}
 \begin{block}{ファイル}
\begin{minted}[]{text}
test
|-- minitest_helper.rb
`-- test_gem_minitest.rb
\end{minted}
\end{block}
\begin{block}{内容}
\begin{description}
\item[{\texttt{minitest\_helper.rb}}] テストを実行する際に必ず読み込まれる
\item[{\texttt{test\_gem\_minitest.rb}}] テストを書く場所
\end{description}
\end{block}
\end{frame}


\section{minitestの書き方}
\label{sec-6-3}
\begin{frame}[label=sec-6-3-1]{minitestのドキュメント}
\begin{block}{ドキュメント}
\begin{itemize}
\item 英語版
\begin{itemize}
\item \href{http://ruby-doc.org/stdlib-2.1.0/libdoc/minitest/rdoc/MiniTest.html}{Module: MiniTest (Ruby 2.1.0)}
\end{itemize}
\item 日本語版
\begin{itemize}
\item \href{http://docs.ruby-lang.org/ja/2.1.0/library/minitest=2funit.html}{library minitest/unit}
\end{itemize}
\end{itemize}
\end{block}
\end{frame}
\begin{frame}[label=sec-6-3-2]{Assertion}
\begin{itemize}
\item Assertionとは？
\begin{itemize}
\item \href{http://docs.ruby-lang.org/ja/2.1.0/class/MiniTest=3a=3aAssertions.html}{module MiniTest::Assertions}
\end{itemize}
\end{itemize}
\end{frame}
\begin{frame}[label=sec-6-3-3]{Gem版minitest}
\begin{block}{コード}
\begin{itemize}
\item GitHub参照
\begin{itemize}
\item \href{https://github.com/ychubachi/gem_minitest}{ychubachi/gem\_minitest}
\end{itemize}
\end{itemize}
\end{block}
\end{frame}

\section{演習課題}
\label{sec-6-4}
\begin{frame}[fragile,label=sec-6-4-1]{6-1 Gemの作成}
 \begin{block}{課題}
\begin{itemize}
\item テストの演習をするためのGemを作成しなさい
\end{itemize}
\end{block}
\begin{block}{コマンド}
\begin{minted}[]{bash}
bundle gem mini_test_practice --test=minitest
\end{minted}
\end{block}
\end{frame}

\begin{frame}[fragile,label=sec-6-4-2]{6-2 メソッドの作成(1)}
 \begin{block}{課題}
\begin{itemize}
\item 次の仕様に沿ったテストを作成しなさい
\item テストができたら，コードを書きなさい
\end{itemize}
\end{block}
\begin{block}{仕様}
\begin{description}
\item[{メソッド名}] \texttt{odd?}
\item[{内容}] 整数を入力として受け取り，値が奇数ならば真を返す
\end{description}
\end{block}
\end{frame}

\begin{frame}[fragile,label=sec-6-4-3]{6-3 メソッドの作成(2)}
 \begin{block}{課題}
\begin{itemize}
\item 次の仕様に沿ったテストを作成しなさい
\item テストができたら，コードを書きなさい
\end{itemize}
\end{block}
\begin{block}{仕様}
\begin{description}
\item[{メソッド名}] \texttt{check\_number?}
\item[{内容}] 引数が0以外ではじまる4桁の数字であり，なおかつ，値が偶数ならば
真を返す
\end{description}
\end{block}
\end{frame}

\begin{frame}[fragile,label=sec-6-4-4]{6-4 メソッドの作成(3)}
 \begin{block}{課題}
\begin{itemize}
\item 次の仕様に沿ったテストを作成しなさい
\item テストができたら，コードを書きなさい
\end{itemize}
\end{block}
\begin{block}{仕様}
\begin{description}
\item[{メソッド名}] \texttt{enough\_length?}
\item[{内容}] 文字列を受け取り，その長さが3文字以上，8文字以下であれば
真を返す
\end{description}
\end{block}
\end{frame}

\begin{frame}[fragile,label=sec-6-4-5]{6-5 メソッドの作成(4)}
 \begin{block}{課題}
\begin{itemize}
\item 次の仕様に沿ったテストを作成しなさい
\item テストができたら，コードを書きなさい
\end{itemize}
\end{block}
\begin{block}{仕様}
\begin{description}
\item[{メソッド名}] \texttt{divide}
\item[{内容}] 引数として割る数と割られる数を取り，割り算をした結果を返す．
ただし，0で割り算をしたら例外を発生する
\end{description}
\end{block}
\end{frame}

\begin{frame}[fragile,label=sec-6-4-6]{6-6 メソッドの作成(5)}
 \begin{block}{課題}
\begin{itemize}
\item 次の仕様に沿ったテストを作成しなさい
\item テストができたら，コードを書きなさい
\end{itemize}
\end{block}
\begin{block}{仕様}
\begin{description}
\item[{メソッド名}] \texttt{fizz\_buzz}
\item[{内容}] 引数に数値を1つとる．3の倍数の時は”Fizz”を返す．
5の倍数の時は”Buzz”を返す．3と5の公倍数のときは”FizzBuzz”を返す．
\end{description}
\end{block}
\end{frame}

\begin{frame}[label=sec-6-4-7]{6-7 メソッドの作成(6)}
\begin{block}{課題}
\begin{itemize}
\item 次の仕様に沿ったテストを作成しなさい
\item テストができたら，コードを書きなさい
\end{itemize}
\end{block}
\begin{block}{仕様}
\begin{itemize}
\item 標準出力に「Hello」と表示するプログラムのテストと実装を行いなさい
\end{itemize}
\end{block}
\end{frame}

\begin{frame}[label=sec-6-4-8]{参考}
\begin{block}{サンプル}
\begin{itemize}
\item \url{https://github.com/ychubachi/mini_test_practice}
\end{itemize}
\end{block}
\end{frame}

\part{第7章 テスト自動化と統合テスト}
\label{sec-7}
\section{Guardによる方法}
\label{sec-7-1}
\begin{frame}[fragile,label=sec-7-1-1]{Guardとは？}
 \begin{itemize}
\item \texttt{Guard} とは，ファイルの更新を監視して，更新があれば指定されたタスクを
実行する仕組み
\item 詳細
\begin{itemize}
\item \href{https://github.com/guard/guard}{guard/guard}
\end{itemize}
\end{itemize}
\end{frame}
\begin{frame}[label=sec-7-1-2]{MiniTestの自動化}
\begin{itemize}
\item Guardにはプラグイン機能がある
\item MiniTest用のプラグイン
\begin{itemize}
\item \href{https://github.com/guard/guard-minitest}{guard/guard-minitest}
\end{itemize}
\item Gemfileに追加し，bundle installが必要
\end{itemize}
\end{frame}
\begin{frame}[label=sec-7-1-3]{サンプル}
\begin{itemize}
\item Guard用の設定を行ったコード
\begin{itemize}
\item \href{https://github.com/ychubachi/mini_test_practice}{ychubachi/mini\_test\_practice}
\end{itemize}
\end{itemize}
\end{frame}
